Documents/ЗаявкаНаВыплатуРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВыплатуРасхода</Name>
			<BasedOn>
				<xr:Item>Document.РасходПоЗадачеПроекта</xr:Item>
				<xr:Item>Document.РасходПоЗадачеПроизводство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасходПоЗадаче</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходПоЗадачеПроизводство</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходПоЗадачеПроекта</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаВыплатуРасхода/Ext/ManagerModule.bsl
// остаток запланированного расхода по указанной документу, статье,  РКО
Функция ПолучитьПланПоСтатьеРасхода( ЗаявкаНаВыплату ) Экспорт
	Отбор 	= Новый Структура;
	Отбор.Вставить("СтатьяРасходов", 	ЗаявкаНаВыплату.СтатьяРасходов );
	Отбор.Вставить("РКО", 		ЗаявкаНаВыплату.РКО );
	План 	= ЗаявкаНаВыплату.РасходПоЗадаче.Описание.Выгрузить(Отбор, "Сумма");
	Возврат План.Итог("Сумма"); 
	
КонецФункции


// остаток запланированного расхода по указанной документу, статье,  РКО
Функция ПолучитьОстатокПоСтатьеРасхода( ЗаявкаНаВыплату, СтатьяРасходов, РКО ) Экспорт
	РасходПоЗадаче 	= ЗаявкаНаВыплату.РасходПоЗадаче;
	
	
	Если ЗначениеЗаполнено(РасходПоЗадаче)
	и	 ЗначениеЗаполнено(СтатьяРасходов) Тогда
	Иначе
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч( РасходПоЗадаче ) = Тип("ДокументСсылка.РасходПоЗадачеПроекта") Тогда
		НазвТипа = "РасходПоЗадачеПроекта"
	Иначе
		НазвТипа = "РасходПоЗадачеПроизводство"
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(План.Сумма) КАК СуммаПлан,
		|	СУММА(0) КАК СуммаВыплачено
		|ИЗ
		|	Документ." + НазвТипа + ".Описание КАК План
		|ГДЕ
		|	План.СтатьяРасходов = &СтатьяРасходов
		|	И План.РКО = &РКО
		|	И План.Ссылка.Проведен
		|	И План.Ссылка.Ссылка = &РасходПоЗадаче
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(0),
		|	СУММА(ЗаявкаНаВыплатуРасхода.СуммаДокумента)
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуРасхода КАК ЗаявкаНаВыплатуРасхода
		|ГДЕ
		|	ЗаявкаНаВыплатуРасхода.Ссылка <> &Ссылка
		|	И ЗаявкаНаВыплатуРасхода.Проведен
		|	И ЗаявкаНаВыплатуРасхода.СтатьяРасходов = &СтатьяРасходов
		|	И ЗаявкаНаВыплатуРасхода.РКО = &РКО
		|	И ЗаявкаНаВыплатуРасхода.РасходПоЗадаче = &РасходПоЗадаче";

	//
	Запрос.УстановитьПараметр("РасходПоЗадаче", РасходПоЗадаче);
	Запрос.УстановитьПараметр("РКО", 			РКО);
	Запрос.УстановитьПараметр("СтатьяРасходов", СтатьяРасходов);
	Запрос.УстановитьПараметр("Ссылка", 		ЗаявкаНаВыплату);

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда 
		Возврат 0;
	КонецЕсли;
	Возврат  Результат.Итог( "СуммаПлан")-Результат.Итог( "СуммаВыплачено")

КонецФункции
